cmsis-svd/cmsis-svd/data/NordicSemi/nrf5340_app.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DCNF_NS</name>
      <description>Domain configuration management 0</description>
      <baseAddress>0x40000000</baseAddress>
      <headerStructName>DCNF</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>DCNF</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CPUID</name>
          <description>CPU ID of this subsystem</description>
          <addressOffset>0x420</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPUID</name>
              <description>CPU ID</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>EXTPERI[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTPERI</headerStructName>
          <access>read-write</access>
          <addressOffset>0x440</addressOffset>
          <register>
            <name>PROTECT</name>
            <description>Description cluster: Control access for master connected to AMLI master port EXTPERI[n]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SLAVE0</name>
                <description>Control access to slave 0 of master EXTPERI[n]</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>EXTRAM[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTRAM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x460</addressOffset>
          <register>
            <name>PROTECT</name>
            <description>Description cluster: Control access from master connected to AMLI master port EXTRAM[n]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SLAVE0</name>
                <description>Control access to slave 0 of master EXTRAM[n]</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE1</name>
                <description>Control access to slave 1 of master EXTRAM[n]</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE2</name>
                <description>Control access to slave 2 of master EXTRAM[n]</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE3</name>
                <description>Control access to slave 3 of master EXTRAM[n]</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE4</name>
                <description>Control access to slave 4 of master EXTRAM[n]</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE5</name>
                <description>Control access to slave 5 of master EXTRAM[n]</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE6</name>
                <description>Control access to slave 6 of master EXTRAM[n]</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLAVE7</name>
                <description>Control access to slave 7 of master EXTRAM[n]</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>EXTCODE[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCNF_EXTCODE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x480</addressOffset>
          <register>
            <name>PROTECT</name>
            <description>Description cluster: Control access from master connected to AMLI master port EXTCODE[n]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SLAVE0</name>
                <description>Control access to slave 0 of master EXTCODE[n]</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Access to slave is allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Access to slave is blocked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
