cmsis-svd/cmsis-svd/data/NordicSemi/nrf5340_app.svd
                    <description>Channel25 has its secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Channel25 has its non-secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHANNEL26</name>
                <description>Select secure attribute.</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Channel26 has its secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Channel26 has its non-secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHANNEL27</name>
                <description>Select secure attribute.</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Channel27 has its secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Channel27 has its non-secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHANNEL28</name>
                <description>Select secure attribute.</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Channel28 has its secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Channel28 has its non-secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHANNEL29</name>
                <description>Select secure attribute.</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Channel29 has its secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Channel29 has its non-secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHANNEL30</name>
                <description>Select secure attribute.</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Channel30 has its secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Channel30 has its non-secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHANNEL31</name>
                <description>Select secure attribute.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Channel31 has its secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Channel31 has its non-secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LOCK</name>
            <description>Description cluster: Prevent further modification of the corresponding PERM register</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LOCK</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>DPPI[n].PERM register can't be changed until next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>DPPI[n].PERM register content can be changed</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
