cmsis-svd/cmsis-svd/data/NordicSemi/nrf5340_app.svd
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Pin 29 has its non-secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PIN30</name>
                <description>Select secure attribute attribute for PIN 30.</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Pin 30 has its secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Pin 30 has its non-secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PIN31</name>
                <description>Select secure attribute attribute for PIN 31.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Pin 31 has its secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Pin 31 has its non-secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LOCK</name>
            <description>Description cluster: Prevent further modification of the corresponding PERM register</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LOCK</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>GPIOPORT[n].PERM register can't be changed until next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>GPIOPORT[n].PERM register content can be changed</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>FLASHNSC[%s]</name>
          <description>Unspecified</description>
          <headerStructName>SPU_FLASHNSC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>REGION</name>
            <description>Description cluster: Define which flash region can contain the non-secure callable (NSC) region n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>REGION</name>
                <description>Region number</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SIZE</name>
            <description>Description cluster: Define the size of the non-secure callable (NSC) region n</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Size of the non-secure callable (NSC) region n</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>The region n is not defined as a non-secure callable region. Normal security attributes (secure or non-secure) are enforced.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32</name>
                    <description>The region n is defined as non-secure callable with a 32-byte size</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64</name>
                    <description>The region n is defined as non-secure callable with a 64-byte size</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>128</name>
                    <description>The region n is defined as non-secure callable with a 128-byte size</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256</name>
                    <description>The region n is defined as non-secure callable with a 256-byte size</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>512</name>
                    <description>The region n is defined as non-secure callable with a 512-byte size</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1024</name>
                    <description>The region n is defined as non-secure callable with a 1024-byte size</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2048</name>
                    <description>The region n is defined as non-secure callable with a 2048-byte size</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4096</name>
                    <description>The region n is defined as non-secure callable with a 4096-byte size</description>
                    <value>8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>RAMNSC[%s]</name>
          <description>Unspecified</description>
          <headerStructName>SPU_RAMNSC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x540</addressOffset>
          <register>
            <name>REGION</name>
            <description>Description cluster: Define which RAM region can contain the non-secure callable (NSC) region n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>REGION</name>
                <description>Region number</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SIZE</name>
            <description>Description cluster: Define the size of the non-secure callable (NSC) region n</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Size of the non-secure callable (NSC) region n</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>The region n is not defined as a non-secure callable region. Normal security attributes (secure or non-secure) are enforced.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32</name>
                    <description>The region n is defined as non-secure callable with a 32-byte size</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64</name>
                    <description>The region n is defined as non-secure callable with a 64-byte size</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>128</name>
                    <description>The region n is defined as non-secure callable with a 128-byte size</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256</name>
                    <description>The region n is defined as non-secure callable with a 256-byte size</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>512</name>
                    <description>The region n is defined as non-secure callable with a 512-byte size</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1024</name>
                    <description>The region n is defined as non-secure callable with a 1024-byte size</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2048</name>
                    <description>The region n is defined as non-secure callable with a 2048-byte size</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4096</name>
                    <description>The region n is defined as non-secure callable with a 4096-byte size</description>
                    <value>8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>64</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>FLASHREGION[%s]</name>
          <description>Unspecified</description>
          <headerStructName>SPU_FLASHREGION</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>PERM</name>
            <description>Description cluster: Access permissions for flash region n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000017</resetValue>
            <fields>
              <field>
                <name>EXECUTE</name>
                <description>Configure instruction fetch permissions from flash region n</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow instruction fetches from flash region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block instruction fetches from flash region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITE</name>
                <description>Configure write permission for flash region n</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow write operation to region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block write operation to region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READ</name>
                <description>Configure read permissions for flash region n</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow read operation from flash region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block read operation from flash region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECATTR</name>
                <description>Security attribute for flash region n</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Non_Secure</name>
                    <description>Flash region n security attribute is non-secure</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Flash region n security attribute is secure</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>64</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>RAMREGION[%s]</name>
          <description>Unspecified</description>
          <headerStructName>SPU_RAMREGION</headerStructName>
          <access>read-write</access>
          <addressOffset>0x700</addressOffset>
          <register>
            <name>PERM</name>
            <description>Description cluster: Access permissions for RAM region n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000017</resetValue>
            <fields>
              <field>
                <name>EXECUTE</name>
                <description>Configure instruction fetch permissions from RAM region n</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow instruction fetches from RAM region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block instruction fetches from RAM region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITE</name>
                <description>Configure write permission for RAM region n</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow write operation to RAM region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block write operation to RAM region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READ</name>
                <description>Configure read permissions for RAM region n</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Allow read operation from RAM region n</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Block read operation from RAM region n</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECATTR</name>
                <description>Security attribute for RAM region n</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Non_Secure</name>
                    <description>RAM region n security attribute is non-secure</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>RAM region n security attribute is secure</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
