cmsis-svd/cmsis-svd/data/NordicSemi/nrf5340_app.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OSCILLATORS_NS</name>
      <description>Oscillator control 0</description>
      <baseAddress>0x40004000</baseAddress>
      <headerStructName>OSCILLATORS</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>OSCILLATORS</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>XOSC32MCAPS</name>
          <description>Programmable capacitance of XC1 and XC2</description>
          <addressOffset>0x5C4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CAPVALUE</name>
              <description>Value representing capacitance, calculated using provided equation</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable on-chip capacitors on XC1 and XC2</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Capacitor disabled (use external caps)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Capacitor enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>XOSC32KI</name>
          <description>Unspecified</description>
          <headerStructName>OSCILLATORS_XOSC32KI</headerStructName>
          <access>read-write</access>
          <addressOffset>0x6C0</addressOffset>
          <register>
            <name>BYPASS</name>
            <description>Enable or disable bypass of LFCLK crystal oscillator with external clock source</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>BYPASS</name>
                <description>Enable or disable bypass of LFCLK crystal oscillator with external clock source</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable (use with xtal or low-swing external source)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable (use with rail-to-rail external source)</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INTCAP</name>
            <description>Control usage of internal load capacitors</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>INTCAP</name>
                <description>Control usage of internal load capacitors</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>External</name>
                    <description>Use external load capacitors</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>C6PF</name>
                    <description>6 pF internal load capacitance</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>C7PF</name>
                    <description>7 pF internal load capacitance</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>C11PF</name>
                    <description>11 pF internal load capacitance</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>REGULATORS_NS</name>
      <description>Voltage regulators 0</description>
      <baseAddress>0x40004000</baseAddress>
      <alternatePeripheral>OSCILLATORS_NS</alternatePeripheral>
      <headerStructName>REGULATORS</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>REGULATORS</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>MAINREGSTATUS</name>
          <description>Main supply status</description>
          <addressOffset>0x428</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VREGH</name>
              <description>VREGH status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Normal voltage mode. Voltage supplied on VDD and VDDH.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>High voltage mode. Voltage supplied on VDDH.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTEMOFF</name>
          <description>System OFF register</description>
          <addressOffset>0x500</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYSTEMOFF</name>
              <description>Enable System OFF mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enter</name>
                  <description>Enable System OFF mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POFCON</name>
          <description>Power-fail comparator configuration</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>POF</name>
              <description>Enable or disable power-fail comparator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRESHOLD</name>
              <description>Power-fail comparator threshold setting</description>
              <lsb>1</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V19</name>
                  <description>Set threshold to 1.9 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V20</name>
                  <description>Set threshold to 2.0 V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V21</name>
                  <description>Set threshold to 2.1 V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V22</name>
                  <description>Set threshold to 2.2 V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V23</name>
                  <description>Set threshold to 2.3 V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V24</name>
                  <description>Set threshold to 2.4 V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V25</name>
                  <description>Set threshold to 2.5 V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V26</name>
                  <description>Set threshold to 2.6 V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V27</name>
                  <description>Set threshold to 2.7 V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V28</name>
                  <description>Set threshold to 2.8 V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRESHOLDVDDH</name>
              <description>Power-fail comparator threshold setting for voltage supply on VDDH</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V27</name>
                  <description>Set threshold to 2.7 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V28</name>
                  <description>Set threshold to 2.8 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V29</name>
                  <description>Set threshold to 2.9 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V30</name>
                  <description>Set threshold to 3.0 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V31</name>
                  <description>Set threshold to 3.1 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V32</name>
                  <description>Set threshold to 3.2 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V33</name>
                  <description>Set threshold to 3.3 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V34</name>
                  <description>Set threshold to 3.4 V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V35</name>
                  <description>Set threshold to 3.5 V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V36</name>
                  <description>Set threshold to 3.6 V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V37</name>
                  <description>Set threshold to 3.7 V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V38</name>
                  <description>Set threshold to 3.8 V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V39</name>
                  <description>Set threshold to 3.9 V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V40</name>
                  <description>Set threshold to 4.0 V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V41</name>
                  <description>Set threshold to 4.1 V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V42</name>
                  <description>Set threshold to 4.2 V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>VREGMAIN</name>
          <description>Unspecified</description>
          <headerStructName>REGULATORS_VREGMAIN</headerStructName>
          <access>read-write</access>
          <addressOffset>0x704</addressOffset>
          <register>
            <name>DCDCEN</name>
            <description>DC/DC enable register for VREGMAIN</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DCDCEN</name>
                <description>Enable or disable DC/DC converter</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>VREGRADIO</name>
          <description>Unspecified</description>
          <headerStructName>REGULATORS_VREGRADIO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x900</addressOffset>
          <register>
            <name>DCDCEN</name>
            <description>DC/DC enable register for VREGRADIO</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DCDCEN</name>
                <description>Enable or disable DC/DC converter</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>VREGH</name>
          <description>Unspecified</description>
          <headerStructName>REGULATORS_VREGH</headerStructName>
          <access>read-write</access>
          <addressOffset>0xB00</addressOffset>
          <register>
            <name>DCDCEN</name>
            <description>DC/DC enable register for VREGH</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DCDCEN</name>
                <description>Enable or disable DC/DC converter</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
