cmsis-svd/cmsis-svd/data/NordicSemi/nrf5340_app.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="P0_NS">
      <name>P1_NS</name>
      <description>GPIO Port 1</description>
      <baseAddress>0x40842800</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=SPLIT-->
    </peripheral>
    <peripheral derivedFrom="P0_NS">
      <name>P0_S</name>
      <description>GPIO Port 2</description>
      <baseAddress>0x50842500</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=SPLIT-->
    </peripheral>
    <peripheral derivedFrom="P0_NS">
      <name>P1_S</name>
      <description>GPIO Port 3</description>
      <baseAddress>0x50842800</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=SPLIT-->
    </peripheral>
    <peripheral>
      <name>CRYPTOCELL_S</name>
      <description>ARM TrustZone CryptoCell register interface</description>
      <baseAddress>0x50844000</baseAddress>
      <headerStructName>CRYPTOCELL</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CRYPTOCELL</name>
        <value>68</value>
      </interrupt>
      <groupName>CRYPTOCELL</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>ENABLE</name>
          <description>Enable CRYPTOCELL subsystem.</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable the CRYPTOCELL subsystem.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CRYPTOCELL subsystem disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>CRYPTOCELL subsystem enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>VMC_NS</name>
      <description>Volatile Memory controller 0</description>
      <baseAddress>0x40081000</baseAddress>
      <headerStructName>VMC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>VMC</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>RAM[%s]</name>
          <description>Unspecified</description>
          <headerStructName>VMC_RAM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>POWER</name>
            <description>Description cluster: RAM[n] power control register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>S0POWER</name>
                <description>Keep RAM section S0 of RAM[n] on or off in System ON mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1POWER</name>
                <description>Keep RAM section S1 of RAM[n] on or off in System ON mode</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S2POWER</name>
                <description>Keep RAM section S2 of RAM[n] on or off in System ON mode</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S3POWER</name>
                <description>Keep RAM section S3 of RAM[n] on or off in System ON mode</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S4POWER</name>
                <description>Keep RAM section S4 of RAM[n] on or off in System ON mode</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S5POWER</name>
                <description>Keep RAM section S5 of RAM[n] on or off in System ON mode</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S6POWER</name>
                <description>Keep RAM section S6 of RAM[n] on or off in System ON mode</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S7POWER</name>
                <description>Keep RAM section S7 of RAM[n] on or off in System ON mode</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S8POWER</name>
                <description>Keep RAM section S8 of RAM[n] on or off in System ON mode</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S9POWER</name>
                <description>Keep RAM section S9 of RAM[n] on or off in System ON mode</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S10POWER</name>
                <description>Keep RAM section S10 of RAM[n] on or off in System ON mode</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S11POWER</name>
                <description>Keep RAM section S11 of RAM[n] on or off in System ON mode</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S12POWER</name>
                <description>Keep RAM section S12 of RAM[n] on or off in System ON mode</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S13POWER</name>
                <description>Keep RAM section S13 of RAM[n] on or off in System ON mode</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S14POWER</name>
                <description>Keep RAM section S14 of RAM[n] on or off in System ON mode</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S15POWER</name>
                <description>Keep RAM section S15 of RAM[n] on or off in System ON mode</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S0RETENTION</name>
                <description>Keep retention on RAM section S0 of RAM[n] when RAM section is switched off</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1RETENTION</name>
                <description>Keep retention on RAM section S1 of RAM[n] when RAM section is switched off</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S2RETENTION</name>
                <description>Keep retention on RAM section S2 of RAM[n] when RAM section is switched off</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S3RETENTION</name>
                <description>Keep retention on RAM section S3 of RAM[n] when RAM section is switched off</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S4RETENTION</name>
                <description>Keep retention on RAM section S4 of RAM[n] when RAM section is switched off</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S5RETENTION</name>
                <description>Keep retention on RAM section S5 of RAM[n] when RAM section is switched off</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S6RETENTION</name>
                <description>Keep retention on RAM section S6 of RAM[n] when RAM section is switched off</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S7RETENTION</name>
                <description>Keep retention on RAM section S7 of RAM[n] when RAM section is switched off</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S8RETENTION</name>
                <description>Keep retention on RAM section S8 of RAM[n] when RAM section is switched off</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S9RETENTION</name>
                <description>Keep retention on RAM section S9 of RAM[n] when RAM section is switched off</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S10RETENTION</name>
                <description>Keep retention on RAM section S10 of RAM[n] when RAM section is switched off</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>On</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S11RETENTION</name>
                <description>Keep retention on RAM section S11 of RAM[n] when RAM section is switched off</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Off</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
